In [7]:
import pandas as pd

In [8]:
df=pd.DataFrame()
df

Empty DataFrame
Columns: []
Index: []

In [9]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 0 entries
Empty DataFrame

In [10]:
city = ['Comilla','Dhaka','Feni','Chattogram']

In [11]:
city

['Comilla', 'Dhaka', 'Feni', 'Chattogram']

In [12]:
df=pd.DataFrame(city)

In [13]:
df

            0
0     Comilla
1       Dhaka
2        Feni
3  Chattogram

In [14]:
row,col=df.shape

In [15]:
row

4

In [16]:
col

1

In [17]:
df=pd.DataFrame(city,columns=['CITY IN BANGLADESH'])

In [18]:
df

  CITY IN BANGLADESH
0            Comilla
1              Dhaka
2               Feni
3         Chattogram

In [19]:
df=pd.DataFrame(city,columns=['CITY IN BANGLADESH'],index=['c1','c2','c3','c4'])

In [20]:
df

   CITY IN BANGLADESH
c1            Comilla
c2              Dhaka
c3               Feni
c4         Chattogram

In [21]:
city2=['dortmund','Paris','Potsdam','NewYork']
df2=pd.DataFrame(zip(city,city2),columns=['City','City2'])

In [22]:
df.shape

(4, 1)

In [23]:
df

   CITY IN BANGLADESH
c1            Comilla
c2              Dhaka
c3               Feni
c4         Chattogram

In [24]:
df2

         City     City2
0     Comilla  dortmund
1       Dhaka     Paris
2        Feni   Potsdam
3  Chattogram   NewYork

In [25]:
df2.shape

(4, 2)

In [26]:
city3=[['BAVARIA','ERLANGEN'],['NRW','DORTMUND']]

In [27]:
df3=pd.DataFrame(city3)

In [28]:
df3

         0         1
0  BAVARIA  ERLANGEN
1      NRW  DORTMUND

In [29]:
city

['Comilla', 'Dhaka', 'Feni', 'Chattogram']

In [30]:
dic1={

    'city':city,
    'city2':city2

}

In [31]:
dic1

{'city': ['Comilla', 'Dhaka', 'Feni', 'Chattogram'],
 'city2': ['dortmund', 'Paris', 'Potsdam', 'NewYork']}

In [32]:
df5=pd.DataFrame(dic1)

In [33]:
df5

         city     city2
0     Comilla  dortmund
1       Dhaka     Paris
2        Feni   Potsdam
3  Chattogram   NewYork

In [34]:
type(df5)

pandas.core.frame.DataFrame

In [35]:
file_path=r'C:\\Users\\DR. FAHAD\\OneDrive\\Documents\\SalesReport1.xlsx'

In [38]:
df=pd.read_excel('C:\\Users\\DR. FAHAD\\OneDrive\\Documents\\SalesReport1.xlsx')

In [39]:
df

           Product Customer    Qtr 1  Qtr 2   Qtr 3    Qtr 4
0     Alice Mutton    ANTON     0.00  702.0    0.00     0.00
1     Alice Mutton    BERGS   312.00    0.0    0.00     0.00
2     Alice Mutton    BOLID     0.00    0.0    0.00  1170.00
3     Alice Mutton    BOTTM  1170.00    0.0    0.00     0.00
4     Alice Mutton    ERNSH  1123.20    0.0    0.00  2607.15
..             ...      ...      ...    ...     ...      ...
272  Veggie-spread    FOLIG     0.00    0.0    0.00  1317.00
273  Veggie-spread    HUNGO   921.37    0.0    0.00     0.00
274  Veggie-spread    MORGK     0.00  263.4    0.00     0.00
275  Veggie-spread    PICCO     0.00    0.0    0.00   395.10
276  Veggie-spread    WHITC     0.00    0.0  842.88     0.00

[277 rows x 6 columns]

In [40]:
df.head()

        Product Customer   Qtr 1  Qtr 2  Qtr 3    Qtr 4
0  Alice Mutton    ANTON     0.0  702.0    0.0     0.00
1  Alice Mutton    BERGS   312.0    0.0    0.0     0.00
2  Alice Mutton    BOLID     0.0    0.0    0.0  1170.00
3  Alice Mutton    BOTTM  1170.0    0.0    0.0     0.00
4  Alice Mutton    ERNSH  1123.2    0.0    0.0  2607.15

In [41]:
df.tail()

           Product Customer   Qtr 1  Qtr 2   Qtr 3   Qtr 4
272  Veggie-spread    FOLIG    0.00    0.0    0.00  1317.0
273  Veggie-spread    HUNGO  921.37    0.0    0.00     0.0
274  Veggie-spread    MORGK    0.00  263.4    0.00     0.0
275  Veggie-spread    PICCO    0.00    0.0    0.00   395.1
276  Veggie-spread    WHITC    0.00    0.0  842.88     0.0

In [42]:
df.head(10)

        Product Customer   Qtr 1   Qtr 2  Qtr 3    Qtr 4
0  Alice Mutton    ANTON     0.0   702.0    0.0     0.00
1  Alice Mutton    BERGS   312.0     0.0    0.0     0.00
2  Alice Mutton    BOLID     0.0     0.0    0.0  1170.00
3  Alice Mutton    BOTTM  1170.0     0.0    0.0     0.00
4  Alice Mutton    ERNSH  1123.2     0.0    0.0  2607.15
5  Alice Mutton    GODOS     0.0   280.8    0.0     0.00
6  Alice Mutton    HUNGC    62.4     0.0    0.0     0.00
7  Alice Mutton    PICCO     0.0  1560.0  936.0     0.00
8  Alice Mutton    RATTC     0.0   592.8    0.0     0.00
9  Alice Mutton    REGGC     0.0     0.0    0.0   741.00

In [43]:
df.tail(10)

                             Product Customer    Qtr 1  Qtr 2    Qtr 3   Qtr 4
267  Uncle Bob's Organic Dried Pears    SAVEA     0.00    0.0  1350.00     0.0
268  Uncle Bob's Organic Dried Pears    VAFFE     0.00    0.0   300.00     0.0
269  Uncle Bob's Organic Dried Pears    VICTE   364.80  300.0     0.00     0.0
270                    Veggie-spread    ALFKI     0.00    0.0     0.00   878.0
271                    Veggie-spread    ERNSH  2281.50    0.0     0.00     0.0
272                    Veggie-spread    FOLIG     0.00    0.0     0.00  1317.0
273                    Veggie-spread    HUNGO   921.37    0.0     0.00     0.0
274                    Veggie-spread    MORGK     0.00  263.4     0.00     0.0
275                    Veggie-spread    PICCO     0.00    0.0     0.00   395.1
276                    Veggie-spread    WHITC     0.00    0.0   842.88     0.0

In [45]:
df.values

array([['Alice Mutton', 'ANTON', 0.0, 702.0, 0.0, 0.0],
       ['Alice Mutton', 'BERGS', 312.0, 0.0, 0.0, 0.0],
       ['Alice Mutton', 'BOLID', 0.0, 0.0, 0.0, 1170.0],
       ...,
       ['Veggie-spread', 'MORGK', 0.0, 263.4, 0.0, 0.0],
       ['Veggie-spread', 'PICCO', 0.0, 0.0, 0.0, 395.1],
       ['Veggie-spread', 'WHITC', 0.0, 0.0, 842.88, 0.0]], dtype=object)

In [46]:
df.columns

Index(['Product', 'Customer', 'Qtr 1', 'Qtr 2', 'Qtr 3', 'Qtr 4'], dtype='object')

In [47]:
df.index

RangeIndex(start=0, stop=277, step=1)

In [49]:
df.Customer

0      ANTON
1      BERGS
2      BOLID
3      BOTTM
4      ERNSH
       ...
272    FOLIG
273    HUNGO
274    MORGK
275    PICCO
276    WHITC
Name: Customer, Length: 277, dtype: object

In [50]:
df['Product'].head()

0    Alice Mutton
1    Alice Mutton
2    Alice Mutton
3    Alice Mutton
4    Alice Mutton
Name: Product, dtype: object

In [51]:
df[['Product','Customer','Qtr 1']]

           Product Customer    Qtr 1
0     Alice Mutton    ANTON     0.00
1     Alice Mutton    BERGS   312.00
2     Alice Mutton    BOLID     0.00
3     Alice Mutton    BOTTM  1170.00
4     Alice Mutton    ERNSH  1123.20
..             ...      ...      ...
272  Veggie-spread    FOLIG     0.00
273  Veggie-spread    HUNGO   921.37
274  Veggie-spread    MORGK     0.00
275  Veggie-spread    PICCO     0.00
276  Veggie-spread    WHITC     0.00

[277 rows x 3 columns]

In [53]:
df['Qtr 3'].sort_values()

0         0.0
161       0.0
163       0.0
164       0.0
165       0.0
        ...
50     1776.5
175    2088.0
47     2261.0
53     2380.0
10     3900.0
Name: Qtr 3, Length: 277, dtype: float64

In [58]:
df.sort_values('Product')

           Product Customer    Qtr 1  Qtr 2   Qtr 3    Qtr 4
0     Alice Mutton    ANTON     0.00  702.0    0.00     0.00
1     Alice Mutton    BERGS   312.00    0.0    0.00     0.00
2     Alice Mutton    BOLID     0.00    0.0    0.00  1170.00
3     Alice Mutton    BOTTM  1170.00    0.0    0.00     0.00
4     Alice Mutton    ERNSH  1123.20    0.0    0.00  2607.15
..             ...      ...      ...    ...     ...      ...
271  Veggie-spread    ERNSH  2281.50    0.0    0.00     0.00
272  Veggie-spread    FOLIG     0.00    0.0    0.00  1317.00
273  Veggie-spread    HUNGO   921.37    0.0    0.00     0.00
274  Veggie-spread    MORGK     0.00  263.4    0.00     0.00
276  Veggie-spread    WHITC     0.00    0.0  842.88     0.00

[277 rows x 6 columns]

In [59]:
df.describe()

             Qtr 1        Qtr 2        Qtr 3        Qtr 4
count   277.000000   277.000000   277.000000   277.000000
mean     88.855271   156.805199   150.327581   161.744621
std     254.991062   389.259507   433.856409   386.840078
min       0.000000     0.000000     0.000000     0.000000
25%       0.000000     0.000000     0.000000     0.000000
50%       0.000000     0.000000     0.000000     0.000000
75%       0.000000    96.500000     0.000000   110.400000
max    2281.500000  3159.000000  3900.000000  2700.000000

In [62]:
import seaborn as sns
sns.heatmap(df.corr(),annot=True)

ValueError: could not convert string to float: 'Alice Mutton'

In [63]:
df['Qtr 1']>50

0      False
1       True
2      False
3       True
4       True
       ...
272    False
273     True
274    False
275    False
276    False
Name: Qtr 1, Length: 277, dtype: bool